Ruby_version/convert/app/controllers/merchants_controller.rb

SELECT  "merchants".* FROM "merchants"  WHERE "merchants"."id" = ? LIMIT 1  [["id", 6]]
---
  def show
    @merchant = Merchant.find(params[:id])

SELECT "merchants".* FROM "merchants"
---
  def index
    @merchants = Merchant.all