Ruby_version/convert/app/controllers/purchasers_controller.rb

  def index
    @purchasers = Purchaser.all
---
SELECT "purchasers".* FROM "purchasers"